Revit 2027 API
Viewport.GetBoxOutline Method
 Returns the outline of the viewport on the sheet, excluding the viewport label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline GetBoxOutline()
Public Function GetBoxOutline As Outline
public:
Outline^ GetBoxOutline()
member GetBoxOutline : unit -> Outline
Return Value
Outline
 The outline of the viewport on the sheet.
Exceptions
Exception | Condition
InvalidOperationException |  The viewport is not on a sheet.
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace